## Labels

In [13]:
import pandas as pd
import numpy as np

In [14]:
ser = pd.Series(range(5), index=['a', 'b', 'c', 'd', 'e'])
ser

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [15]:
### slicing
slice_1 = ser[:4]
slice_2 = ser[1:]
print(slice_1, '\n')
print(slice_2, '\n')

a    0
b    1
c    2
d    3
dtype: int64

b    1
c    2
d    3
e    4
dtype: int64

In [16]:
slice_1.align(slice_2)

(a    0.0
 b    1.0
 c    2.0
 d    3.0
 e    NaN
 dtype: float64,
 a    NaN
 b    1.0
 c    2.0
 d    3.0
 e    4.0
 dtype: float64)

In [17]:
slice_1.align(slice_2, join='left')

(a    0
 b    1
 c    2
 d    3
 dtype: int64,
 a    NaN
 b    1.0
 c    2.0
 d    3.0
 dtype: float64)

In [18]:
slice_1.align(slice_2, join='right')

(b    1.0
 c    2.0
 d    3.0
 e    NaN
 dtype: float64,
 b    1
 c    2
 d    3
 e    4
 dtype: int64)

In [39]:
slice_1.align(slice_2, join='inner')

(b    1
 c    2
 d    3
 dtype: int64,
 b    1
 c    2
 d    3
 dtype: int64)

In [40]:
arr = np.random.randint(10, 50, size=(2,3))
# print(arr)
df_1 = pd.DataFrame(arr, ['A', 'B'], ['C', 'D', 'E'])
df_2 = pd.DataFrame(arr, ['B', 'C'], ['C', 'D', 'E'])
print(df_1, '\n')
print(df_2)

    C   D   E
A  18  16  43
B  15  26  48

    C   D   E
B  18  16  43
C  15  26  48

In [41]:
df_1.align(df_2)

(      C     D     E
 A  18.0  16.0  43.0
 B  15.0  26.0  48.0
 C   NaN   NaN   NaN,
       C     D     E
 A   NaN   NaN   NaN
 B  18.0  16.0  43.0
 C  15.0  26.0  48.0)

In [42]:
ser.reindex(['c', 'b', 'a'])

c    2
b    1
a    0
dtype: int64

In [43]:
df_1.reindex(['B', 'A'])

    C   D   E
B  15  26  48
A  18  16  43

In [44]:
df_1.drop(['A'], axis=0)   ### 0: rows

    C   D   E
B  15  26  48

In [45]:
df_1.drop(['D'], axis=1)   ### 1: columns

    C   E
A  18  43
B  15  48

In [47]:
### rename labels
df_1.rename(columns={'C': 'Men', 'D': 'Women', 'E': 'Pets'})

   Men  Women  Pets
A   18     16    43
B   15     26    48

[('Day 1', 1), ('Day 1', 2), ('Day 1', 3), ('Day 2', 1), ('Day 2', 2), ('Day 2', 3)]
           M    F
Day 1 1  634  617
      2  601  629
      3  646  593
Day 2 1  685  525
      2  584  622
      3  518  658

     M    F
1  634  617
2  601  629
3  646  593